<!-- azurenoops/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"b22f5e6ff7cfd17e7840fe56566dc603562a447cd45beba4a4fa76bc450600ef","plan_job_ref":"Job Create MPE Management terraform plan #91 at https://github.com/AFMPE/mpe_management/actions/runs/4871721821","plan_hash":"e95a19162bba98f483c1d13ae42a84a85db43411129baf9e6f4e4a883a0cfd7a","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __src__
With backend config: `storage_account_name=afmpetfmgtprodh8dc4qua
container_name=core-mgt-prod-tfstate            
resource_group_name=afmpe-network-artifacts-rg
`
With var files: `src/tfvars/production/parameters.prod.tfvars
`<details open><summary>With variables</summary>

```hcl
state_sa_container_name           = (sensitive value)
state_sa_name                     = (sensitive value)
state_sa_rg                       = (sensitive value)
subscription_id_hub               = (sensitive value)
subscription_id_internal          = (sensitive value)
subscription_id_partners_gsa_dev  = (sensitive value)
subscription_id_partners_gsa_prod = (sensitive value)
subscription_id_sandbox           = (sensitive value)
```
</details>
<details>
<summary>Plan: 2 to add, 2 to change, 1 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.mod_sentinel_rule_alerts.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.mod_sentinel_rule_alerts.azurerm_sentinel_data_connector_microsoft_threat_intelligence.dataMTI must be replaced
-/+ resource "azurerm_sentinel_data_connector_microsoft_threat_intelligence" "dataMTI" {
      + bing_safety_phishing_url_lookback_date       = "1970-01-01T00:00:00Z" # forces replacement
      ~ id                                           = "*************************************************************************************************************************************************************************************************************************************************************" -> (known after apply)
        name                                         = "MSTI_Connector"
      ~ tenant_id                                    = "************************************" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.landing_zone.module.mod_operational_logging.azurerm_security_center_subscription_pricing.main["StorageAccounts"] will be updated in-place
  ~ resource "azurerm_security_center_subscription_pricing" "main" {
        id            = "/subscriptions/7eb60145-02f2-4fc1-80d2-e25d2ce9e45d/providers/Microsoft.Security/pricings/StorageAccounts"
      - subplan       = "PerTransaction" -> null
        # (2 unchanged attributes hidden)
    }

  # module.landing_zone.module.mod_operational_logging.azurerm_security_center_subscription_pricing.main["VirtualMachines"] will be updated in-place
  ~ resource "azurerm_security_center_subscription_pricing" "main" {
        id            = "/subscriptions/7eb60145-02f2-4fc1-80d2-e25d2ce9e45d/providers/Microsoft.Security/pricings/VirtualMachines"
      - subplan       = "P2" -> null
        # (2 unchanged attributes hidden)
    }

  # module.mod_management_groups_budgets[0].module.mod_mpe_mg_budgets.azurerm_consumption_budget_management_group.mg_budget will be created
  + resource "azurerm_consumption_budget_management_group" "mg_budget" {
      + amount              = 14000
      + etag                = (known after apply)
      + id                  = (known after apply)
      + management_group_id = "**********************************************************"
      + name                = "MPE Workloads Budget"
      + time_grain          = "Monthly"

      + notification {
          + contact_emails = [
              + "afmpe_admins@missionpartners.us",
            ]
          + enabled        = true
          + operator       = "GreaterThan"
          + threshold      = 90
          + threshold_type = "Actual"
        }

      + time_period {
          + end_date   = "2024-06-01T00:00:00Z"
          + start_date = "2023-05-01T00:00:00Z"
        }
    }

Plan: 2 to add, 2 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Create MPE Management terraform plan #91](https://github.com/AFMPE/mpe_management/actions/runs/4871721821)